knyghtryda/oepl-cc2630-firmware/firmware/main.c
    // --- Boot message ---
    rtt_puts("RST=");
    rtt_put_hex8((uint8_t)SysCtrlResetSourceGet());
    rtt_puts(" IOC=");
    rtt_put_hex8(ioc_frozen ? 1 : 0);
    rtt_puts(" WARM=");
    rtt_put_hex8(warm_boot ? 1 : 0);
    rtt_puts("\r\n");

    // Watchdog: from here on anything that hangs for ~90s gets reset.
    oepl_hw_wdt_init();

    // A watchdog reset is a warm reset with no fault record: synthesise one
    // so it is reported like a crash (PC 0xDEADD006 = watchdog). Standby
    // wakeups also come through reset, so only a cold boot counts.
    if (!warm_boot && SysCtrlResetSourceGet() == RSTSRC_WARMRESET &&
        !fault_record_valid(&g_fault)) {
        g_fault.pc = FAULT_PC_WATCHDOG;
        g_fault.lr = g_fault.sp = g_fault.cfsr = g_fault.bfar = 0;
        fault_record_seal(&g_fault);
    }

#ifdef DIAG_SLEEP_ONLY
    // make DIAG_SLEEP_ONLY=1: every DIO high-impedance except DIO5 (panel
    // supply) held low and DIO11 (SPI flash CS) held high, no radio, no
    // display -- just standby in a loop. The
    // PPK2 reading is then the MCU + board floor with nothing driven.
    for (uint8_t dio = 0; dio <= 30; dio++) {
        if (dio == 5 || dio == 11) continue;
        GPIO_setOutputEnableDio(dio, GPIO_OUTPUT_DISABLE);
        IOCPortConfigureSet(dio, IOC_PORT_GPIO, IOC_NO_IOPULL | IOC_INPUT_DISABLE);
    }
    IOCPinTypeGpioOutput(5);
    GPIO_setOutputEnableDio(5, GPIO_OUTPUT_ENABLE);
    GPIO_clearDio(5);   // panel supply off (high = on: +160 uA measured)
    IOCPinTypeGpioOutput(11);          // SPI flash CS: deselected
    GPIO_setOutputEnableDio(11, GPIO_OUTPUT_ENABLE);
    GPIO_setDio(11);
    oepl_hw_flash_deep_sleep();
    GPIO_setOutputEnableDio(9, GPIO_OUTPUT_DISABLE);
    GPIO_setOutputEnableDio(10, GPIO_OUTPUT_DISABLE);
    IOCPortConfigureSet(9, IOC_PORT_GPIO, IOC_NO_IOPULL | IOC_INPUT_DISABLE);
    IOCPortConfigureSet(10, IOC_PORT_GPIO, IOC_NO_IOPULL | IOC_INPUT_DISABLE);

    rtt_puts("DIAG_SLEEP_ONLY\r\n");
    while (1) enter_sleep(20);
#endif

    // Report a HardFault from the previous run (record written by the handler)
    bool had_fault = fault_record_valid(&g_fault);
    // A cold boot means any crash capture in RAM predates the power cycle
    // (SRAM keeps its contents for a moment) -- discard it, so tooling can't
    // mistake a stale capture for a fresh one.
    if (!had_fault) g_crash.magic = 0;
    g_fault.magic = 0;                 // consumed (or rejected): don't re-report
    struct fault_record last_fault = {0};
    char fault_str[40] = "";
    if (had_fault) {
        last_fault = g_fault;
        rtt_puts("LAST FAULT: PC="); rtt_put_hex32(last_fault.pc);
        rtt_puts(" LR="); rtt_put_hex32(last_fault.lr);
        rtt_puts(" SP="); rtt_put_hex32(last_fault.sp);
        rtt_puts(" CFSR="); rtt_put_hex32(last_fault.cfsr);
        rtt_puts(" BFAR="); rtt_put_hex32(last_fault.bfar);
        rtt_puts("\r\n");
        // Shown in red on the splash so a sealed tag's crash can be read off
        // the panel: "FAULT PC=xxxxxxxx CFSR=xxxxxxxx"
        static const char hexd[] = "0123456789ABCDEF";
        char *q = fault_str;
        memcpy(q, "FAULT PC=", 9); q += 9;
        for (int i = 28; i >= 0; i -= 4) *q++ = hexd[(last_fault.pc >> i) & 0xF];
        memcpy(q, " CFSR=", 6); q += 6;
        for (int i = 28; i >= 0; i -= 4) *q++ = hexd[(last_fault.cfsr >> i) & 0xF];
        *q = 0;
    }

    // Print MAC in human-readable form
    uint8_t mac[8];
    oepl_rf_get_mac(mac);
    rtt_puts("MAC: ");
    print_mac_msb(mac);
    rtt_puts("\r\n");

    // --- Board peripherals to their low-power state ---
    // Panel: unpowered, lines released. Don't run uc8159_init() here: it
    // powers the panel, and nothing would power it off again before standby;
    // both draw paths call uc8159_wake(). External flash: deep power-down.
    oepl_hw_gpio_init();
    oepl_hw_epd_pins_off();
    if (!warm_boot) oepl_hw_flash_deep_sleep();

    // --- Initialize RF core ---
    rf_status_t rc = oepl_rf_init();
    if (rc != RF_OK) {
        rtt_puts("RF init FAILED: ");
        rtt_put_hex8(rc);
        rtt_puts("\r\n");
        goto idle;
    }
    rtt_puts("RF init OK\r\n");

    // --- Initialize OEPL radio protocol layer ---
    oepl_radio_init();

    // --- Splash screen only on cold boot ---
    if (!warm_boot) {
        rtt_puts("SPLASH: drawing\r\n");
        oepl_radio_set_wakeup_reason(WAKEUP_REASON_SPLASH);
        int8_t splash_ch = oepl_radio_scan_channels();
        int8_t temp_c;
        uint16_t bat_mv;
        oepl_hw_get_temperature(&temp_c);
        oepl_hw_get_voltage(&bat_mv);
        radio_state_t *rst = oepl_radio_get_state();
        splash_display(mac, bat_mv, temp_c, splash_ch >= 0, rst->current_ieee_ch,
                       had_fault ? fault_str : NULL);
        rtt_puts("SPLASH: done\r\n");
    } else {
        rtt_puts("WARM BOOT: skipping splash\r\n");
    }

    // Tell the AP the first checkin after a crash is a fault reset (0xFE);
    // it shows up as wakeupReason in the AP tag DB, with the fault PC/status
    // encoded in that one checkin's battery/temperature/LQI fields.
    if (had_fault) {
        oepl_radio_set_wakeup_reason(WAKEUP_REASON_WDT_RESET);
        if (last_fault.pc == FAULT_PC_RF_DOORBELL) {
            uint32_t op = last_fault.lr;
            uint16_t cmd = (op & 1) ? (uint16_t)(0x8000 | ((op >> 16) & 0x7FFF))
                                    : (uint16_t)(op & 0x7FFF);
            oepl_radio_set_fault_report(FAULT_CLASS_DOORBELL, cmd,
                                        (uint8_t)((last_fault.sp & 3) << 6 | (last_fault.cfsr & 0x3F)));
        } else if (last_fault.pc == FAULT_PC_WATCHDOG) {
            oepl_radio_set_fault_report(FAULT_CLASS_WATCHDOG, 0, 0);
        } else {
            uint8_t cls = FAULT_CLASS_HARDFAULT | ((last_fault.pc >> 16) & 3) |
                          (((last_fault.pc >> 28) == 2) ? 4 : 0);
            oepl_radio_set_fault_report(cls, (uint16_t)(last_fault.pc & 0xFFFF),
                                        (uint8_t)((((last_fault.cfsr >> 16) & 0xF) << 4) |
                                                  ((last_fault.cfsr >> 8) & 0xF)));
        }
    }

