knyghtryda/oepl-cc2630-firmware/firmware/main.c
    // --- Main loop: periodic checkin + sleep ---
    // Standby (RTC wakeup) between every check-in.
    //
    // Back-off: when the AP can't be reached (AP down, out of range) or an
    // update can't be completed, retry after 30 s, 60 s, 120 s ... up to
    // 15 min instead of every 30 s. A failed check-in can cost ~30 s of
    // receive (scan plus direct check-in on every channel) and a failed
    // download up to a couple of minutes at ~8 mA; at a fixed 30 s retry a
    // tag in a bad spot could spend tens of mAh a day on nothing. 15 min
    // stays inside the AP's 20-minute window for pending data.
    uint32_t checkin_count = 0;
    uint8_t checkin_fail_streak = 0;
    uint8_t xfer_fail_streak = 0;
    while (1) {
        rtt_puts("\r\n=== Checkin #");
        rtt_put_hex32(checkin_count);
        rtt_puts(" ===\r\n");

        struct AvailDataInfo info;
        memset(&info, 0, sizeof(info));

#ifdef BENCH_FORCE_CHECKIN_FAIL
        bool checkin_ok = false;
#else
        bool checkin_ok = do_scan_and_checkin(&info);
#endif
        if (oepl_rf_hung()) {
            // Radio core wedged during this check-in: report it once and let
            // the shutdown/re-init either side of the next sleep clear it.
            uint32_t op = oepl_rf_hung_op();
            uint16_t cmd = (op & 1) ? (uint16_t)(0x8000 | ((op >> 16) & 0x7FFF))
                                    : (uint16_t)(op & 0x7FFF);
            oepl_radio_set_fault_report(FAULT_CLASS_DOORBELL, cmd,
                                        (uint8_t)((oepl_rf_hung_phase() & 3) << 6 |
                                                  oepl_rf_hung_cmdsta()));
            rtt_puts("RF hung: recovering at next wake\r\n");
            oepl_rf_hung_clear();
            checkin_ok = false;
        }
        uint32_t wait_sec;

        if (checkin_ok) {
            checkin_fail_streak = 0;
            rtt_puts("Checkin OK: dataType=");
            rtt_put_hex8(info.dataType);
            rtt_puts(" nextCheckIn=");
            rtt_put_hex8((info.nextCheckIn >> 8) & 0xFF);
            rtt_put_hex8(info.nextCheckIn & 0xFF);
            rtt_puts("\r\n");

            bool xfer_failed = false;
            bool xfer_done = false;   // only a completed update clears the failure streak
            if (info.dataType == DATATYPE_FW_UPDATE) {
                if (oepl_ota_already_applied(info.dataVer)) {
                    rtt_puts("OTA: already applied, sending XferComplete\r\n");
                    oepl_radio_send_xfer_complete();
                    xfer_done = true;
                } else {
                    rtt_puts("*** FW UPDATE ***\r\n");
                    oepl_ota_download_and_apply(&info);
                    // Returns only on failure — will retry next checkin
                    rtt_puts("FW update failed, retry later\r\n");
                    xfer_failed = true;
                }
            } else if (info.dataType != DATATYPE_NOUPDATE) {
#ifdef BENCH_FORCE_XFER_FAIL
                bool shown = false;
#else
                bool shown = download_and_display(&info);
#endif
                if (shown) {
                    rtt_puts("*** IMAGE DISPLAYED ***\r\n");
                    xfer_done = true;
                } else {
                    rtt_puts("Display failed, will retry\r\n");
                    xfer_failed = true;
                }
                oepl_radio_set_wakeup_reason(WAKEUP_REASON_TIMED);
            } else {
                rtt_puts("No pending data\r\n");
                oepl_radio_set_wakeup_reason(WAKEUP_REASON_TIMED);
            }

            // AP sends nextCheckIn in minutes; convert to seconds
            wait_sec = (uint32_t)info.nextCheckIn * 60;
            if (wait_sec < RETRY_MIN_S) wait_sec = RETRY_MIN_S;
            if (wait_sec > 3600) wait_sec = 3600;

            if (xfer_failed) {
                if (xfer_fail_streak < 8) xfer_fail_streak++;
                uint32_t b = retry_backoff_s(xfer_fail_streak);
                if (b > wait_sec) wait_sec = b;
                rtt_puts("Update failed x");
                rtt_put_hex8(xfer_fail_streak);
                rtt_puts(", back off\r\n");
            } else if (xfer_done) {
                // (A "no pending data" check-in doesn't reset it: the AP can
                // flap between offering and not offering the same image.)
                xfer_fail_streak = 0;
            }
        } else {
            wait_sec = retry_backoff_s(checkin_fail_streak);
            if (checkin_fail_streak < 8) checkin_fail_streak++;
            rtt_puts("Checkin failed x");
            rtt_put_hex8(checkin_fail_streak);
            rtt_puts(", back off\r\n");
        }

#ifdef BENCH_TEST_HARDFAULT
        // Bench: a real bus fault (RF core registers with the domain off) on the
        // 3rd check-in, to verify the HardFault record against a known location
        if (checkin_count == 2) {
            rtt_puts("BENCH: forcing HardFault\r\n");
            PRCMPowerDomainOff(PRCM_DOMAIN_RFCORE);
            oepl_rf_rx_stop();
        }
#endif
#ifdef BENCH_TEST_DOORBELL_HANG
        // Bench: provoke a doorbell timeout (RF core powered off, then abort)
        // on the 3rd check-in to exercise crash capture and the fault report.
        if (checkin_count == 2) {
            rtt_puts("BENCH: forcing doorbell hang\r\n");
            HWREG(RFC_PWR_NONBUF_BASE + RFC_PWR_O_PWMCLKEN) = 0;   // RFCClockDisable(): CPE stops answering
            oepl_rf_rx_stop();
        }
#endif
        enter_sleep(wait_sec);

        // After sleep, RF core was shut down — re-init before next checkin
        {
            bool rf_ok = false;
            for (uint8_t retry = 0; retry < 5; retry++) {
                if (retry > 0) {
                    rtt_puts("RF re-init retry ");
                    rtt_put_hex8(retry);
                    rtt_puts("\r\n");
                    delay_cycles(48000000);  // ~1s delay between retries
                }
                rc = oepl_rf_init();
                if (rc == RF_OK) {
                    rf_ok = true;
                    break;
                }
            }
            if (!rf_ok) {
                // All retries failed — system reset instead of dying
                rtt_puts("RF re-init FAILED x5, RESET\r\n");
                // Brief delay so RTT/UART output flushes
                delay_cycles(4800000);
                // Reset via ROM Hard-API
                typedef void (*reset_fn_t)(void);
                uint32_t *hapi_table = (uint32_t *)0x10000048;
                reset_fn_t rom_reset = (reset_fn_t)hapi_table[6];
                rom_reset();
                // Should not reach here
                while (1) __asm volatile("nop");
            }
            oepl_radio_init();
        }

        checkin_count++;
    }

idle:
    // Fatal error — wait 10 seconds then reset to try again
    rtt_puts("Fatal error, reset in 10s\r\n");
    for (uint8_t i = 0; i < 10; i++)
        delay_cycles(48000000);  // ~1s each
    {
        typedef void (*reset_fn_t)(void);
        uint32_t *hapi_table = (uint32_t *)0x10000048;
        reset_fn_t rom_reset = (reset_fn_t)hapi_table[6];
        rom_reset();
    }
    while (1) __asm volatile("nop");

    return 0;
}
